# -*- coding: utf-8 -*-

from __future__ import unicode_literals

import number2chinese


def test_number2chinese():
    cases = [
        (0, '零'),
        (10, '十'),
        (12, '十二'),
        (20, '二十'),
        (22, '二十二'),

        (100, '一百'),
        (101, '一百零一'),
        (110, '一百一十'),

        (1100, '一千一百'),
        (1010, '一千零一十'),
        (1001, '一千零一'),
        (1110, '一千一百一十'),
        (1011, '一千零一十一'),
        (1111, '一千一百一十一'),

        (10000, '一万'),

        (10001, '一万零一'),
        (10010, '一万零一十'),
        (10100, '一万零一百'),
        (11000, '一万一千'),

        (11001, '一万一千零一'),
        (11010, '一万一千零一十'),
        (11100, '一万一千一百'),
        (10101, '一万零一百零一'),
        (10110, '一万零一百一十'),
        (10011, '一万零一十一'),

        (11110, '一万一千一百一十'),
        (11101, '一万一千一百零一'),
        (11011, '一万一千零一十一'),
        (10111, '一万零一百一十一'),

        (100000, '十万'),

        (110000, '十一万'),
        (101000, '十万零一千'),
        (100100, '十万零一百'),
        (100010, '十万零一十'),
        (100001, '十万零一'),

        (111000, '十一万一千'),
        (110100, '十一万零一百'),
        (110010, '十一万零一十'),
        (110001, '十一万零一'),

        (111100, '十一万一千一百'),
        (111010, '十一万一千零一十'),
        (110110, '十一万零一百一十'),
        (111001, '十一万一千零一'),
        (110101, '十一万零一百零一'),
        (110011, '十一万零一十一'),

        (1000000, '一百万'),

        (1100000, '一百一十万'),
        (1010000, '一百零一万'),
        (1001000, '一百万零一千'),
        (1000100, '一百万零一百'),
        (1000010, '一百万零一十'),
        (1000001, '一百万零一'),

        (10000000, '一千万'),
        (10010000, '一千零一万'),
        (11003000, '一千一百万零三千'),
        (10013000, '一千零一万三千'),
        (10010300, '一千零一万零三百'),

        (100000000, '一亿'),
        (110000000, '一亿一千万'),
        (1000000000, '十亿'),
        (10010000000, '一百亿零一千万'),

        (pow(10, 11), '一千亿'),
        (pow(10, 12), None),
    ]
    for number, expected in cases:
        assert expected == number2chinese.number2chinese(number)
